tap "cartr/qt4"
tap "caskroom/cask"
tap "d12frosted/emacs-plus"
tap "eugenmayer/dockersync"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "linux-noah/noah"
tap "luckyframework/lucky"
tap "vitorgalvao/tiny-scripts"
cask "osxfuse"
cask "xquartz"
brew "libyaml"
brew "readline", link: true
brew "xz"
brew "ansible"
brew "gcc"
brew "awscli"
brew "bash"
brew "bat"
brew "boost"
brew "libffi"
brew "cask"
brew "cassandra"
brew "clojure"
brew "cmake"
brew "libevent"
brew "diff-so-fancy"
brew "docker", link: false
brew "docker-machine-driver-hyperkit"
brew "doitlive"
brew "elasticsearch", restart_service: true
brew "jpeg"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "gawk"
brew "git"
brew "glfw"
brew "gnupg"
brew "llvm"
brew "qt"
brew "gnuplot", args: ["with-qt"]
brew "gource"
brew "graphviz"
brew "gsl"
brew "highlight"
brew "htop"
brew "hub"
brew "imagemagick", link: false
brew "imagemagick@6", link: true
brew "kafka"
brew "kubernetes-cli"
brew "lesspipe"
brew "libdnet"
brew "lsd"
brew "macvim"
brew "mongodb"
brew "mysql"
brew "neovim"
brew "nmap"
brew "ntfs-3g"
brew "octave"
brew "pass"
brew "redis", restart_service: true
brew "rethinkdb"
brew "ripgrep"
brew "rsync"
brew "shellcheck"
brew "squashfs"
brew "telnet"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "translate-shell"
brew "unison"
brew "unrar"
brew "watch"
brew "watchman"
brew "websocketd"
brew "wget"
brew "wine"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "cartr/qt4/qt@4", link: false
brew "d12frosted/emacs-plus/emacs-plus"
brew "eugenmayer/dockersync/unox"
brew "heroku/brew/heroku"
brew "linux-noah/noah/noah"
brew "luckyframework/lucky/lucky"
brew "vitorgalvao/tiny-scripts/cask-repair"
cask "aerial"
cask "airflow"
cask "arduino"
cask "bettertouchtool"
cask "boxer"
cask "calibre"
cask "cerebro"
cask "chromedriver"
cask "coconutbattery"
cask "dash"
cask "docker"
cask "fantastical"
cask "firefox"
cask "flux"
cask "font-hack-nerd-font"
cask "geogebra"
cask "gimp"
cask "grammarly"
cask "graphql-ide"
cask "graphql-playground"
cask "growlnotify"
cask "insomnia"
cask "intellij-idea"
cask "iterm2"
cask "java"
cask "java8"
cask "karabiner-elements"
cask "keybase"
cask "kindle"
cask "kitty"
cask "mactex"
cask "minikube"
cask "muse"
cask "netbeans"
cask "ngrok"
cask "openemu"
cask "openinterminal"
cask "pagico"
cask "pdf-expert"
cask "postgres"
cask "postico"
cask "postman"
cask "qbittorrent"
cask "qnapi"
cask "repetier-host"
cask "retinizer"
cask "sensiblesidebuttons"
cask "skype"
cask "slack"
cask "slic3r"
cask "spectacle"
cask "spotify"
cask "staruml"
cask "steam"
cask "texstudio"
cask "the-unarchiver"
cask "torbrowser"
cask "ultimaker-cura"
cask "unrarx"
cask "videostream"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "yummy-ftp"
